Services/filtering/Image_Filtering.MorphologyEx.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:filt">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:MorphologyEx>
   <InputMatFilename></InputMatFilename>
   <morphOperation></morphOperation>
   <StructuringElementFname></StructuringElementFname>
   <iteration-D>1</iteration-D>
   <anchorX-D>-1</anchorX-D>
   <anchorY-D>-1</anchorY-D>
  </ns:MorphologyEx>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
